from string import Template

### RAG PROMPTS ###

## SYSTEM ##

system_prompt = Template("\n".join([
    
    "أنت مساعد مخصص لإنشاء ردود للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "يجب عليك إنشاء رد بناءً على المستندات المقدمة فقط.",
    "تجاهل المستندات غير المرتبطة باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من إنشاء إجابة مناسبة.",
    "يجب أن تكون الإجابة بنفس لغة استفسار المستخدم.",
    "كن مهذبًا ومحترمًا أثناء الرد على المستخدم.",
    "كن دقيقًا ومختصرًا في إجابتك وتجنب المعلومات غير الضرورية.",
]))

## DOCUMENT ##

document_prompt = Template(
    "\n".join([
        "## المستند رقم $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

### Footer ###

footer_prompt = Template("\n".join([
    "اعتمادًا فقط على المستندات أعلاه، يرجى إنشاء إجابة للمستخدم.",
    "## استفسار المستخدم:",
    "$query",
    ""
    "## الإجابة:",
]))
